app/views/events/index.html.erb

      <% if events.any? %>
        <%= link_to date.day, event_path(events.first), class: 'event-date' %>
---
SELECT "events".* FROM "events"