app/views/photos/create.turbo_stream.erb

UPDATE "photos" SET "image_data" = $1, "updated_at" = $2 WHERE "photos"."id" = $3
---
<%= turbo_stream.prepend "photos", partial: 'photo', locals: { photo: @photo } %>
<%= turbo_stream.update dom_id(@photo), "" %>