app/controllers/attendances_controller.rb

  def create
    passcode_entered = params[:passcode] # Adjusted to fetch passcode correctly

    if passcode_entered == @event.passcode
      @attendance = Attendance.new(user: current_user, event: @event, present: true, checked_in_at: Time.current)

      if @attendance.save
---
INSERT INTO "attendances" ("event_id", "user_id", "present", "passcode", "checked_in_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["event_id", 1], ["user_id", 15], ["present", false], ["passcode", nil], ["checked_in_at", nil], ["created_at", "2024-09-21 19:50:45.210340"], ["updated_at", "2024-09-21 19:50:45.210340"]]