app/controllers/AttendancesController.rb

  def create
    @attendance = Attendance.find_or_initialize_by(event: @event, user: current_user)
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."user_id" = $2 LIMIT $3  [["event_id", 1], ["user_id", 15], ["LIMIT", 1]]