app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1 AND "attendances"."user_id" = $2 LIMIT $3  [["event_id", 1], ["user_id", 15], ["LIMIT", 1]]
UPDATE "attendances" SET "present" = $1, "checked_in_at" = $2, "updated_at" = $3 WHERE "attendances"."id" = $4  [["present", true], ["checked_in_at", "2024-09-21 19:52:06.113531"], ["updated_at", "2024-09-21 19:52:06.121991"], ["id", 1]]
---
  def create
    @attendance = Attendance.find_or_initialize_by(event: @event, user: current_user)

    if @event.passcode == params[:passcode] && @event.date.today?
      @attendance.update(present: true, checked_in_at: Time.current)