app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."archived" = $1 AND "events"."start_time" BETWEEN $2 AND $3 ORDER BY start_time asc  [["archived", false], ["start_time", "2024-11-01"], ["start_time", "2024-11-30"]]
---
  def index
    start_date = params[:start_date] ? Date.parse(params[:start_date]).beginning_of_month : Date.today.beginning_of_month
  end_date = start_date.end_of_month

    sort_column = params[:sort] || "start_time" # Replace with your default column
    sort_direction = params[:direction] || "asc"

    @events = Event.where(archived: false, start_time: start_date..end_date).order("#{sort_column} #{sort_direction}")

SELECT "attendances".* FROM "attendances" WHERE "attendances"."event_id" = $1  [["event_id", 1]]
---
  def show
    @attendances = Attendance.where(event: @event)

INSERT INTO "events" ("name", "created_at", "updated_at", "passcode", "archived", "date", "location", "start_time", "end_time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    Rails.logger.debug params[:event]
    @event = Event.new(event_params)
    if @event.save

UPDATE "events" SET "updated_at" = $1, "end_time" = $2, "location" = $3 WHERE "events"."id" = $4  [["updated_at", "2024-10-13 18:03:40.071890"], ["end_time", "2024-10-13 18:03:00"], ["location", ""], ["id", 1]]
---
  def update
    if @event.update(event_params)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    @event = Event.find(params[:id])
    if @event.destroy

SELECT "events".* FROM "events" WHERE "events"."archived" = $1  [["archived", true]]
---
  def archived
    @archived_events = Event.where(archived: true) # Fetches only archived events

UPDATE "events" SET "updated_at" = $1, "archived" = $2 WHERE "events"."id" = $3  [["updated_at", "2024-10-10 22:19:45.252872"], ["archived", false], ["id", 14]]
---
  def archive
    @event.update(archived: true)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1, "archived" = $2 WHERE "events"."id" = $3  [["updated_at", "2024-10-10 22:13:36.876555"], ["archived", false], ["id", 13]]
---
  def unarchive
    @event = Event.find(params[:id])
    if @event.update(archived: false)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def set_event
    @event = Event.find_by(id: params[:id])