app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new(idea_params)
    @idea.user = current_user

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("title", "description", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testing2"], ["description", "d2"], ["created_by", nil], ["created_at", "2024-10-01 22:08:40.964289"], ["updated_at", "2024-10-01 22:08:40.964289"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "description" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["description", "testing"], ["updated_at", "2024-11-03 23:29:00.707072"], ["id", 5]]