app/controllers/leaderboard_categories_controller.rb

SELECT "users".* FROM "users"
SELECT "leaderboard_categories".* FROM "leaderboard_categories"
---
  def index
    @users = User.all
    @leaderboard_categories = LeaderboardCategory.all