app/controllers/leaderboard_categories_controller.rb

  def index
    @users = User.order(points: :desc, full_name: :asc)
    @leaderboard_categories = LeaderboardCategory.order(min_points: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."points" DESC, "users"."full_name" ASC
SELECT "leaderboard_categories".* FROM "leaderboard_categories" WHERE (min_points <= 12) ORDER BY "leaderboard_categories"."min_points" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @leaderboard_category = LeaderboardCategory.new(leaderboard_category_params)

    if @leaderboard_category.save
---
INSERT INTO "leaderboard_categories" ("category_name", "min_points", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_name", "Test category"], ["min_points", 3], ["color", "#000000"], ["created_at", "2024-10-14 02:58:48.327185"], ["updated_at", "2024-10-14 02:58:48.327185"]]

  def update
    if @leaderboard_category.update(leaderboard_category_params)
---
UPDATE "leaderboard_categories" SET "category_name" = $1, "min_points" = $2, "updated_at" = $3 WHERE "leaderboard_categories"."id" = $4  [["category_name", "Test category 2"], ["min_points", 4], ["updated_at", "2024-10-14 03:00:01.477477"], ["id", 2]]

  def destroy
    @leaderboard_category.destroy
---
DELETE FROM "leaderboard_categories" WHERE "leaderboard_categories"."id" = $1  [["id", 2]]

  def set_leaderboard_category
    @leaderboard_category = LeaderboardCategory.find(params[:id])
---
SELECT "leaderboard_categories".* FROM "leaderboard_categories" WHERE "leaderboard_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]