app/controllers/links_controller.rb

    def index
      @links = Link.all
---
SELECT "links".* FROM "links" ORDER BY "links"."id" ASC