app/controllers/merchandises_controller.rb

  def index
    @merchandises = Merchandise.all
---
SELECT "merchandises".* FROM "merchandises"

  def edit
    @merchandise = Merchandise.find(params[:id])
---
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @merchandise = Merchandise.new(merchandise_params)
    Rails.logger.debug("Merchandise link: #{@merchandise.link}")

    respond_to do |format|
      if @merchandise.link.present? && valid_flywire_link(@merchandise.link)
        image_url = get_image(@merchandise.link)
        @merchandise.image = image_url if image_url

        if @merchandise.save
---
SELECT "links".* FROM "links"
INSERT INTO "merchandises" ("link", "title", "description", "image", "stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @merchandise = Merchandise.find(params[:id])
    Rails.logger.debug("Updating Merchandise link: #{@merchandise.link}")

    respond_to do |format|
      @merchandise.assign_attributes(merchandise_params)
      if @merchandise.link.present? && valid_flywire_link(@merchandise.link)
        image_url = get_image(@merchandise.link)
        @merchandise.image = image_url if image_url

        if @merchandise.save
---
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "links".* FROM "links"
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "merchandises" SET "link" = $1, "updated_at" = $2 WHERE "merchandises"."id" = $3  [["link", "ww.linl.com"], ["updated_at", "2024-10-21 22:17:55.570527"], ["id", 1]]

  def destroy
    @merchandise.destroy
---
DELETE FROM "merchandises" WHERE "merchandises"."id" = $1  [["id", 1]]

  def set_merchandise
    @merchandise = Merchandise.find(params[:id])
---
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]