app/controllers/merchandises_controller.rb

  def destroy
    @merchandise.destroy
---
DELETE FROM "merchandises" WHERE "merchandises"."id" = $1  [["id", 2]]