app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY "photos"."id" ASC
---
  def index
    @photos = Photo.order(id: :desc)

SELECT "photos".* FROM "photos" ORDER BY "photos"."id" ASC
INSERT INTO "photos" ("image_data", "title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    handle_blank_photo and return if params[:photo].blank?

    @photo = current_user.photos.build(photo_params)

    if @photo.save

UPDATE "photos" SET "title" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["title", "test1"], ["updated_at", "2024-10-13 21:23:05.904527"], ["id", 3]]
---
  def update
    if @photo.update(photo_params)

SELECT "photos".* FROM "photos"
---
  def gallery
    @photos = Photo.all