app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
  def index
    @users = User.order(:id)

UPDATE "users" SET "committee" = $1, "role" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["committee", ""], ["role", "member"], ["updated_at", "2024-11-03 22:31:34.261865"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1000]]
UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["points", 0], ["updated_at", "2024-11-05 02:21:28.725718"], ["id", 334]]
---
  def reset_points
    User.find_each { |user| user.update(points: 0) } # Ensures validations are respected