app/models/leaderboard_category.rb

  def self.category_for_user(points)
    where('min_points <= ?', points).order(min_points: :desc).first
---
SELECT "leaderboard_categories".* FROM "leaderboard_categories" WHERE (min_points <= 12) ORDER BY "leaderboard_categories"."min_points" DESC LIMIT $1  [["LIMIT", 1]]