app/models/user.rb

  def self.from_google(email:, full_name:, uid:, avatar_url:)
    create_with(uid:, full_name:, avatar_url:, role: 'admin').find_or_create_by!(email:)
---
INSERT INTO "users" ("email", "full_name", "uid", "avatar_url", "committee", "points", "dues", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "scpanakin@tamu.edu"], ["LIMIT", 1]]